marpanda00/RUSC/mm-iot-ori/examples/ap_mode/sdkconfig.defaults
# Only available in v6.1 and onwards. Before this a define needed to be added in the CMakeLists.txt
# https://github.com/espressif/esp-idf/commit/16b02aeb7a805de671ca92c0c7630eda091794ce
CONFIG_LWIP_NETIF_LINK_CALLBACK=y

CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_LWIP_IPV6_AUTOCONFIG=y
CONFIG_LWIP_IPV6_DHCP6=y

CONFIG_FREERTOS_HZ=1000

CONFIG_IDF_TARGET="esp32s3"

CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_TCP_MSS=1460
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8760
CONFIG_LWIP_TCP_WND_DEFAULT=14600
CONFIG_LWIP_TCP_RECVMBOX_SIZE=10
CONFIG_LWIP_UDP_RECVMBOX_SIZE=10

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_MBEDTLS_NIST_KW_C=y

CONFIG_BUILD_SUPPLICANT_FROM_SOURCE=y
